mamedev/mame/src/devices/cpu/pic16c62x/pic16c62x.cpp
void pic16c62x_device::movlw()
{
	m_W = m_opcode.b.l;
}

void pic16c62x_device::movwf()
{
	STORE_REGFILE(ADDR, m_W);
}

void pic16c62x_device::nop()
{
	/* Do nothing */
}

void pic16c62x_device::option()
{
	m_OPTION = m_W;
}

void pic16c62x_device::retlw()
{
	m_W = m_opcode.b.l;
	m_PC = POP_STACK();
	PCL = m_PC & 0xff;
}

void pic16c62x_device::returns()
{
	m_PC = POP_STACK();
	PCL = m_PC & 0xff;
}

void pic16c62x_device::retfie()
{
	m_PC = POP_STACK();
	PCL = m_PC & 0xff;
	//INTCON(7)=1;
}

void pic16c62x_device::rlf()
{
	m_ALU = GET_REGFILE(ADDR);
	m_ALU <<= 1;
	if (STATUS & C_FLAG) m_ALU |= 1;
	if (GET_REGFILE(ADDR) & 0x80) SET(STATUS, C_FLAG);
	else CLR(STATUS, C_FLAG);
	STORE_RESULT(ADDR, m_ALU);
}

void pic16c62x_device::rrf()
{
	m_ALU = GET_REGFILE(ADDR);
	m_ALU >>= 1;
	if (STATUS & C_FLAG) m_ALU |= 0x80;
	if (GET_REGFILE(ADDR) & 1) SET(STATUS, C_FLAG);
	else CLR(STATUS, C_FLAG);
	STORE_RESULT(ADDR, m_ALU);
}

void pic16c62x_device::sleepic()
{
	if (WDTE) m_WDT = 0;
	if (PSA) m_prescaler = 0;
	SET(STATUS, TO_FLAG);
	CLR(STATUS, PD_FLAG);
}

void pic16c62x_device::subwf()
{
	m_old_data = GET_REGFILE(ADDR);
	m_ALU = m_old_data - m_W;
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
	CALCULATE_SUB_CARRY();
	CALCULATE_SUB_DIGITCARRY();
}

void pic16c62x_device::sublw()
{
	m_ALU = (m_opcode.b.l & 0xff) - m_W;
	m_W = m_ALU;
	CALCULATE_Z_FLAG();
	CALCULATE_SUB_CARRY();
	CALCULATE_SUB_DIGITCARRY();
}

void pic16c62x_device::swapf()
{
	m_ALU  = ((GET_REGFILE(ADDR) << 4) & 0xf0);
	m_ALU |= ((GET_REGFILE(ADDR) >> 4) & 0x0f);
	STORE_RESULT(ADDR, m_ALU);
}

void pic16c62x_device::tris()
{
	switch(m_opcode.b.l & 0x7)
	{
		case 05:    STORE_REGFILE(0x85, m_W); break;
		case 06:    STORE_REGFILE(0x86, m_W); break;
		default:    illegal(); break;
	}
}

void pic16c62x_device::xorlw()
{
	m_ALU = m_W ^ m_opcode.b.l;
	m_W = m_ALU;
	CALCULATE_Z_FLAG();
}

void pic16c62x_device::xorwf()
{
	m_ALU = GET_REGFILE(ADDR) ^ m_W;
	STORE_RESULT(ADDR, m_ALU);
	CALCULATE_Z_FLAG();
}


/***********************************************************************
 *  Instruction Table (Format, Instruction, Cycles)
 ***********************************************************************/

const pic16c62x_device::pic16c62x_instruction pic16c62x_device::s_instructiontable[]=
{
	{(char *)"000111dfffffff", &pic16c62x_device::addwf, 1},
	{(char *)"000101dfffffff", &pic16c62x_device::andwf, 1},
	{(char *)"0000011fffffff", &pic16c62x_device::clrf, 1},
	{(char *)"00000100000011", &pic16c62x_device::clrw, 1},
	{(char *)"001001dfffffff", &pic16c62x_device::comf, 1},
	{(char *)"000011dfffffff", &pic16c62x_device::decf, 1},
	{(char *)"001011dfffffff", &pic16c62x_device::decfsz, 1},
	{(char *)"001010dfffffff", &pic16c62x_device::incf, 1},
	{(char *)"001111dfffffff", &pic16c62x_device::incfsz, 1},
	{(char *)"000100dfffffff", &pic16c62x_device::iorwf, 1},
	{(char *)"001000dfffffff", &pic16c62x_device::movf, 1},
	{(char *)"0000001fffffff", &pic16c62x_device::movwf, 1},
	{(char *)"0000000xx00000", &pic16c62x_device::nop, 1},
	{(char *)"001101dfffffff", &pic16c62x_device::rlf, 1},
	{(char *)"001100dfffffff", &pic16c62x_device::rrf, 1},
	{(char *)"000010dfffffff", &pic16c62x_device::subwf, 1},
	{(char *)"001110dfffffff", &pic16c62x_device::swapf, 1},
	{(char *)"000110dfffffff", &pic16c62x_device::xorwf, 1},
	{(char *)"0100bbbfffffff", &pic16c62x_device::bcf, 1},
	{(char *)"0101bbbfffffff", &pic16c62x_device::bsf, 1},
	{(char *)"0110bbbfffffff", &pic16c62x_device::btfsc, 1},
	{(char *)"0111bbbfffffff", &pic16c62x_device::btfss, 1},
	{(char *)"11111xkkkkkkkk", &pic16c62x_device::addlw, 1},
	{(char *)"111001kkkkkkkk", &pic16c62x_device::andlw, 1},
	{(char *)"100aaaaaaaaaaa", &pic16c62x_device::call, 2},
	{(char *)"101aaaaaaaaaaa", &pic16c62x_device::goto_op, 2},
	{(char *)"111000kkkkkkkk", &pic16c62x_device::iorlw, 1},
	{(char *)"1100xxkkkkkkkk", &pic16c62x_device::movlw, 1},
	{(char *)"00000000001001", &pic16c62x_device::retfie, 2},
	{(char *)"1101xxkkkkkkkk", &pic16c62x_device::retlw, 2},
	{(char *)"00000000001000", &pic16c62x_device::returns, 2},
	{(char *)"00000001100011", &pic16c62x_device::sleepic, 1},
	{(char *)"11110xkkkkkkkk", &pic16c62x_device::sublw, 1},
	{(char *)"111010kkkkkkkk", &pic16c62x_device::xorlw, 1},
	{(char *)"00000001100100", &pic16c62x_device::clrwdt, 1},
	{(char *)"00000001100010", &pic16c62x_device::option, 1},      // deprecated
	{(char *)"00000001100fff", &pic16c62x_device::tris, 1},        // deprecated
	{nullptr, nullptr, 0}
};

/***********************************************************************
 *  Opcode Table build function
 ***********************************************************************/

void pic16c62x_device::build_opcode_table(void)
{
int instr,mask,bits;
int a;

	// defaults
	for ( a = 0; a < 16384; a++)
	{
		m_opcode_table[a].cycles = 0;
		m_opcode_table[a].function = &pic16c62x_device::illegal;
	}
	// build table
	for( instr = 0; s_instructiontable[instr].cycles != 0; instr++)
	{
		bits=0;
		mask=0;
		for ( a = 0; a < 14; a++)
		{
			switch (s_instructiontable[instr].format[a])
			{
				case '0':
					bits = bits << 1;
					mask = (mask << 1) | 1;
					break;
				case '1':
					bits = (bits << 1) | 1;
					mask = (mask << 1) | 1;
					break;
				default:
					bits = bits << 1;
					mask = mask << 1;
					break;
			}
		}
		for ( a = 0; a < 16384; a++)
		{
			if (((a & mask) == bits) && (m_opcode_table[a].cycles == 0))
			{
				m_opcode_table[a].cycles = s_instructiontable[instr].cycles;
				m_opcode_table[a].function = s_instructiontable[instr].function;
			}
		}
	}
}

/****************************************************************************
 *  Inits CPU emulation
 ****************************************************************************/

void pic16c62x_device::device_start()
{
	m_program = &space(AS_PROGRAM);
	m_direct = &m_program->direct();
	m_data = &space(AS_DATA);
	m_io = &space(AS_IO);

	m_CONFIG = 0x3fff;

	/* ensure the internal ram pointers are set before get_info is called */
	update_internalram_ptr();

	build_opcode_table();

